garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q20.PIC
      <edc:AdjustPoint edc:offset="0xD" edc:_addr="0x30000B"/>
    </edc:ConfigFuseSector>
    <edc:ConfigFuseSector edc:beginaddr="0x300018" edc:endaddr="0x30001A" edc:isotp="true" edc:regionid="config2">
      <edc:DCRDef edc:access="-------n" edc:cname="CONFIG14" edc:desc="" edc:factorydefault="0xff" edc:impl="0x1" edc:name="CONFIG14" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x01" edc:default="0xff" edc:_addr="0x300018">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SAFLOCK" edc:desc="SAF Lock Enable bit" edc:mask="0x1" edc:name="SAFLOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="SAF Lock disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SAF Lock enabled, SAF areas are locked and SAFSZ bits cannot be erased" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG9" edc:desc="Configuration byte 9" edc:factorydefault="0xff" edc:impl="0xff" edc:name="CONFIG9" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xff" edc:default="0xff" edc:_addr="0x300019">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SAFSZ" edc:desc="SAF Block Size Selection bits" edc:mask="0xff" edc:name="SAFSZ" edc:nzwidth="0x8">
              <edc:DCRFieldSemantic edc:cname="SAFSZ_NONE" edc:desc="NONE" edc:when="(field &amp; 0xff) == 0xff"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_128" edc:desc="Last 128 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits" edc:when="(field &amp; 0xff) == 0xfe"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_256" edc:desc="Last 256 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits" edc:when="(field &amp; 0xff) == 0xfC"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_384" edc:desc="Last 384 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits" edc:when="(field &amp; 0xff) == 0xf8"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_512" edc:desc="Last 512 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits" edc:when="(field &amp; 0xff) == 0xf0"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_640" edc:desc="Last 640 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits" edc:when="(field &amp; 0xff) == 0xe0"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_768" edc:desc="Last 768 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits" edc:when="(field &amp; 0xff) == 0xC0"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_896" edc:desc="Last 896 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits" edc:when="(field &amp; 0xff) == 0x80"/>
              <edc:DCRFieldSemantic edc:cname="SAFSZ_1024" edc:desc="Last 1024 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits" edc:when="(field &amp; 0xff) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:EEDataSector edc:beginaddr="0x380000" edc:endaddr="0x380100" edc:regionid="eedata"/>
    <edc:DIASector edc:beginaddr="0x2C0000" edc:endaddr="0x2C0040" edc:regionid="diamem">
      <edc:RegisterArray edc:cname="MUI" edc:_addr="0x2C0000">
        <edc:Register edc:cname="MUI0" edc:nzwidth="16" edc:_addr="0x2C0000"/>
        <edc:Register edc:cname="MUI1" edc:nzwidth="16" edc:_addr="0x2C0002"/>
        <edc:Register edc:cname="MUI2" edc:nzwidth="16" edc:_addr="0x2C0004"/>
        <edc:Register edc:cname="MUI3" edc:nzwidth="16" edc:_addr="0x2C0006"/>
        <edc:Register edc:cname="MUI4" edc:nzwidth="16" edc:_addr="0x2C0008"/>
        <edc:Register edc:cname="MUI5" edc:nzwidth="16" edc:_addr="0x2C000A"/>
        <edc:Register edc:cname="MUI6" edc:nzwidth="16" edc:_addr="0x2C000C"/>
        <edc:Register edc:cname="MUI7" edc:nzwidth="16" edc:_addr="0x2C000E"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="EUI" edc:_addr="0x2C0010">
        <edc:Register edc:cname="EUI0" edc:nzwidth="16" edc:_addr="0x2C0010"/>
        <edc:Register edc:cname="EUI1" edc:nzwidth="16" edc:_addr="0x2C0012"/>
        <edc:Register edc:cname="EUI2" edc:nzwidth="16" edc:_addr="0x2C0014"/>
        <edc:Register edc:cname="EUI3" edc:nzwidth="16" edc:_addr="0x2C0016"/>
        <edc:Register edc:cname="EUI4" edc:nzwidth="16" edc:_addr="0x2C0018"/>
        <edc:Register edc:cname="EUI5" edc:nzwidth="16" edc:_addr="0x2C001A"/>
        <edc:Register edc:cname="EUI6" edc:nzwidth="16" edc:_addr="0x2C001C"/>
        <edc:Register edc:cname="EUI7" edc:nzwidth="16" edc:_addr="0x2C001E"/>
        <edc:Register edc:cname="EUI8" edc:nzwidth="16" edc:_addr="0x2C0020"/>
        <edc:Register edc:cname="EUI9" edc:nzwidth="16" edc:_addr="0x2C0022"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="TSLR" edc:_addr="0x2C0024">
        <edc:Register edc:cname="TSLR1" edc:nzwidth="16" edc:_addr="0x2C0024"/>
        <edc:Register edc:cname="TSLR2" edc:nzwidth="16" edc:_addr="0x2C0026"/>
        <edc:Register edc:cname="TSLR3" edc:nzwidth="16" edc:_addr="0x2C0028"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="TSHR" edc:_addr="0x2C002A">
        <edc:Register edc:cname="TSHR1" edc:nzwidth="16" edc:_addr="0x2C002A"/>
        <edc:Register edc:cname="TSHR2" edc:nzwidth="16" edc:_addr="0x2C002C"/>
        <edc:Register edc:cname="TSHR3" edc:nzwidth="16" edc:_addr="0x2C002E"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="FVRA" edc:_addr="0x2C0030">
        <edc:Register edc:cname="FVRA1X" edc:nzwidth="16" edc:_addr="0x2C0030"/>
        <edc:Register edc:cname="FVRA2X" edc:nzwidth="16" edc:_addr="0x2C0032"/>
        <edc:Register edc:cname="FVRA4X" edc:nzwidth="16" edc:_addr="0x2C0034"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="FVRC" edc:_addr="0x2C0036">
        <edc:Register edc:cname="FVRC1X" edc:nzwidth="16" edc:_addr="0x2C0036"/>
        <edc:Register edc:cname="FVRC2X" edc:nzwidth="16" edc:_addr="0x2C0038"/>
        <edc:Register edc:cname="FVRC4X" edc:nzwidth="16" edc:_addr="0x2C003A"/>
      </edc:RegisterArray>
    </edc:DIASector>
    <edc:DCISector edc:beginaddr="0x3C0000" edc:endaddr="0x3C000A" edc:regionid="dcimem">
      <edc:Register edc:cname="ERSIZ" edc:nzwidth="16" edc:_addr="0x3C0000"/>
      <edc:Register edc:cname="WLSIZ" edc:nzwidth="16" edc:_addr="0x3C0002"/>
      <edc:Register edc:cname="URSIZ" edc:nzwidth="16" edc:_addr="0x3C0004"/>
      <edc:Register edc:cname="EESIZ" edc:nzwidth="16" edc:_addr="0x3C0006"/>
      <edc:Register edc:cname="PCNT" edc:nzwidth="16" edc:_addr="0x3C0008"/>
    </edc:DCISector>
    <edc:RevisionIDSector edc:beginaddr="0x3FFFFC" edc:endaddr="0x3FFFFE" edc:regionid="revid">
      <edc:DEVIDToRev edc:revlist="A0" edc:value="0x7A40"/>
    </edc:RevisionIDSector>
    <edc:DeviceIDSector edc:beginaddr="0x3FFFFE" edc:endaddr="0x400000" edc:regionid="devid" edc:value="0x7A40"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x1500">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:bank="0x0" edc:beginaddr="0x0000" edc:endaddr="0x0100" edc:regionid="sfr0">
        <edc:AdjustPoint edc:offset="0x38" edc:_addr="0x0"/>
        <edc:SFRDef edc:access="-------n" edc:cname="PRLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PRLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x38">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRLOCKED" edc:mask="0x1" edc:name="PRLOCKED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
