garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q20.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="FSCMCON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="FSCMCON" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x82">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSCMFEV" edc:mask="0x1" edc:name="FSCMFEV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FSCMFFI" edc:mask="0x1" edc:name="FSCMFFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FSCMPEV" edc:mask="0x1" edc:name="FSCMPEV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FSCMPFI" edc:mask="0x1" edc:name="FSCMPFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FSCMSEV" edc:mask="0x1" edc:name="FSCMSEV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FSCMSFI" edc:mask="0x1" edc:name="FSCMSFI" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1CON0" edc:desc="I3C CONTROL REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1CON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x83">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IBIREQ" edc:mask="0x1" edc:name="IBIREQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HJREQ" edc:mask="0x1" edc:name="HJREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKP" edc:mask="0x1" edc:name="ACKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLRRXB" edc:mask="0x1" edc:name="CLRRXB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLRTXB" edc:mask="0x1" edc:name="CLRTXB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RST" edc:mask="0x1" edc:name="RST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOEN" edc:mask="0x1" edc:name="BTOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I3C1CON1" edc:desc="I3C CONTROL REGISTER 1" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I3C1CON1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x84">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ACKPOS" edc:mask="0x1" edc:name="ACKPOS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SASDRMD" edc:mask="0x1" edc:name="SASDRMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FHDRE" edc:mask="0x1" edc:name="FHDRE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BERRDET" edc:mask="0x1" edc:name="BERRDET" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I3C1RXB" edc:desc="I3C RECEIVE BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1RXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x85">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1TXB" edc:desc="I3C TRANSMIT BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1TXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x86">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrnrrcc" edc:cname="I3C1STAT0" edc:desc="I3C STATUS REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10001000" edc:name="I3C1STAT0" edc:nzwidth="8" edc:por="10001000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x87">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RNW" edc:mask="0x3" edc:name="RNW" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RXBF" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSTDET" edc:mask="0x1" edc:name="RSTDET" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMD" edc:mask="0x3" edc:name="OPMD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="BFREE" edc:mask="0x1" edc:name="BFREE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------r" edc:cname="I3C1STAT1" edc:desc="I3C STATUS REGISTER 1" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="I3C1STAT1" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x88">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXFNE" edc:mask="0x1" edc:name="TXFNE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="I3C1BSTAT" edc:desc="I3C BUS STATUS REGISTER" edc:impl="0x67" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="I3C1BSTAT" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x89">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TE0ERR" edc:mask="0x1" edc:name="TE0ERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TE1ERR" edc:mask="0x1" edc:name="TE1ERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TE2ERR" edc:mask="0x1" edc:name="TE2ERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TE3ERR" edc:desc="Data/Address bit" edc:mask="0x1" edc:name="TE3ERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TE4ERR" edc:desc="Read/Write Information bit" edc:mask="0x1" edc:name="TE4ERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TE5ERR" edc:mask="0x1" edc:name="TE5ERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TE6ERR" edc:mask="0x1" edc:name="TE6ERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1PIR0" edc:desc="I3C GENERAL INTERRUPT FLAG REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1PIR0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x8A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCCIF" edc:mask="0x1" edc:name="SCCCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTFIF" edc:mask="0x1" edc:name="BTFIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DADRIF" edc:mask="0x1" edc:name="DADRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SADRIF" edc:mask="0x1" edc:name="SADRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CACKIF" edc:mask="0x1" edc:name="I2CACKIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSCIF" edc:mask="0x1" edc:name="RSCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCIF" edc:mask="0x1" edc:name="PCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCIF" edc:mask="0x1" edc:name="SCIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="I3C1PIR1" edc:desc="I3C GENERAL INTERRUPT FLAG REGISTER 1" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="I3C1PIR1" edc:nzwidth="8" edc:por="000-----" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x8B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="IBIDONEIF" edc:mask="0x1" edc:name="IBIDONEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DACHIF" edc:mask="0x1" edc:name="DACHIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCOMPIF" edc:mask="0x1" edc:name="TCOMPIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1ERRIR0" edc:desc="I3C ERROR INTERRUPT FLAG REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1ERRIR0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x8C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCCCIF" edc:mask="0x1" edc:name="UCCCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOIF" edc:mask="0x1" edc:name="BTOIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUSEIF" edc:mask="0x1" edc:name="BUSEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IBIEIF" edc:mask="0x1" edc:name="IBIEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HJEIF" edc:mask="0x1" edc:name="HJEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOIF" edc:mask="0x1" edc:name="RXOIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXUIF" edc:mask="0x1" edc:name="TXUIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CNACKIF" edc:mask="0x1" edc:name="I2CNACKIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I3C1ERRIR1" edc:desc="I3C ERROR INTERRUPT FLAG REGISTER 1" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I3C1ERRIR1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x8D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXREIF" edc:mask="0x1" edc:name="RXREIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWEIF" edc:mask="0x1" edc:name="TXWEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MWLOEIF" edc:mask="0x1" edc:name="MWLOEIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABEIF" edc:mask="0x1" edc:name="ABEIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1PIE0" edc:desc="I3C GENERAL INTERRUPT ENABLE REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1PIE0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x8E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCCIE" edc:mask="0x1" edc:name="SCCCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTFIE" edc:mask="0x1" edc:name="BTFIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DADRIE" edc:mask="0x1" edc:name="DADRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SADRIE" edc:mask="0x1" edc:name="SADRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CACKIE" edc:mask="0x1" edc:name="I2CACKIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSCIE" edc:mask="0x1" edc:name="RSCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCIE" edc:mask="0x1" edc:name="PCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCIE" edc:mask="0x1" edc:name="SCIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
