garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q20.PIC
        <edc:JoinedSFRDef edc:cname="TU16BTMR" edc:desc="" edc:name="TU16BTMR" edc:nzwidth="0x10" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x13E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TU16BCR"/>
          </edc:AliasList>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x13E">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BTMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BTMRL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x13E">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRL" edc:desc="" edc:mask="0xff" edc:name="TMRL" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRL0" edc:mask="0x1" edc:name="TMRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL1" edc:mask="0x1" edc:name="TMRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL2" edc:mask="0x1" edc:name="TMRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL3" edc:mask="0x1" edc:name="TMRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL4" edc:mask="0x1" edc:name="TMRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL5" edc:mask="0x1" edc:name="TMRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL6" edc:mask="0x1" edc:name="TMRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL7" edc:mask="0x1" edc:name="TMRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BTMRL0" edc:mask="0x1" edc:name="TU16BTMRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL1" edc:mask="0x1" edc:name="TU16BTMRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL2" edc:mask="0x1" edc:name="TU16BTMRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL3" edc:mask="0x1" edc:name="TU16BTMRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL4" edc:mask="0x1" edc:name="TU16BTMRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL5" edc:mask="0x1" edc:name="TU16BTMRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL6" edc:mask="0x1" edc:name="TU16BTMRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL7" edc:mask="0x1" edc:name="TU16BTMRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BTMR0" edc:mask="0x1" edc:name="TU16BTMR0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR1" edc:mask="0x1" edc:name="TU16BTMR1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR2" edc:mask="0x1" edc:name="TU16BTMR2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR3" edc:mask="0x1" edc:name="TU16BTMR3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR4" edc:mask="0x1" edc:name="TU16BTMR4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR5" edc:mask="0x1" edc:name="TU16BTMR5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR6" edc:mask="0x1" edc:name="TU16BTMR6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR7" edc:mask="0x1" edc:name="TU16BTMR7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16BCRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCRL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x13E">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRL" edc:desc="" edc:mask="0xff" edc:name="CRL" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRL0" edc:mask="0x1" edc:name="CRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL1" edc:mask="0x1" edc:name="CRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL2" edc:mask="0x1" edc:name="CRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL3" edc:mask="0x1" edc:name="CRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL4" edc:mask="0x1" edc:name="CRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL5" edc:mask="0x1" edc:name="CRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL6" edc:mask="0x1" edc:name="CRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL7" edc:mask="0x1" edc:name="CRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BCRL0" edc:mask="0x1" edc:name="TU16BCRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL1" edc:mask="0x1" edc:name="TU16BCRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL2" edc:mask="0x1" edc:name="TU16BCRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL3" edc:mask="0x1" edc:name="TU16BCRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL4" edc:mask="0x1" edc:name="TU16BCRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL5" edc:mask="0x1" edc:name="TU16BCRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL6" edc:mask="0x1" edc:name="TU16BCRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL7" edc:mask="0x1" edc:name="TU16BCRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BCR0" edc:mask="0x1" edc:name="TU16BCR0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR1" edc:mask="0x1" edc:name="TU16BCR1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR2" edc:mask="0x1" edc:name="TU16BCR2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR3" edc:mask="0x1" edc:name="TU16BCR3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR4" edc:mask="0x1" edc:name="TU16BCR4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR5" edc:mask="0x1" edc:name="TU16BCR5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR6" edc:mask="0x1" edc:name="TU16BCR6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR7" edc:mask="0x1" edc:name="TU16BCR7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
