garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q20.PIC
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x144"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPRT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPRT" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x145">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRT" edc:mask="0xff" edc:name="PRT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRT0" edc:mask="0x1" edc:name="PRT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT1" edc:mask="0x1" edc:name="PRT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT2" edc:mask="0x1" edc:name="PRT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT3" edc:mask="0x1" edc:name="PRT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT4" edc:mask="0x1" edc:name="PRT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT5" edc:mask="0x1" edc:name="PRT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT6" edc:mask="0x1" edc:name="PRT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT7" edc:mask="0x1" edc:name="PRT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16BPRT0" edc:mask="0x1" edc:name="TU16BPRT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT1" edc:mask="0x1" edc:name="TU16BPRT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT2" edc:mask="0x1" edc:name="TU16BPRT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT3" edc:mask="0x1" edc:name="TU16BPRT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT4" edc:mask="0x1" edc:name="TU16BPRT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT5" edc:mask="0x1" edc:name="TU16BPRT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT6" edc:mask="0x1" edc:name="TU16BPRT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT7" edc:mask="0x1" edc:name="TU16BPRT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16BPR24" edc:mask="0x1" edc:name="TU16BPR24" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR25" edc:mask="0x1" edc:name="TU16BPR25" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR26" edc:mask="0x1" edc:name="TU16BPR26" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR27" edc:mask="0x1" edc:name="TU16BPR27" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR28" edc:mask="0x1" edc:name="TU16BPR28" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR29" edc:mask="0x1" edc:name="TU16BPR29" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR30" edc:mask="0x1" edc:name="TU16BPR30" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR31" edc:mask="0x1" edc:name="TU16BPR31" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="TU16BCLK" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="TU16BCLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x146">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x1f" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BCLK0" edc:mask="0x1" edc:name="TU16BCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK1" edc:mask="0x1" edc:name="TU16BCLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK2" edc:mask="0x1" edc:name="TU16BCLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK3" edc:mask="0x1" edc:name="TU16BCLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK4" edc:mask="0x1" edc:name="TU16BCLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TU16BERS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="TU16BERS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x147">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERS" edc:mask="0x3f" edc:name="ERS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ERS0" edc:mask="0x1" edc:name="ERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS1" edc:mask="0x1" edc:name="ERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS2" edc:mask="0x1" edc:name="ERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS3" edc:mask="0x1" edc:name="ERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS4" edc:mask="0x1" edc:name="ERS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS5" edc:mask="0x1" edc:name="ERS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BERS0" edc:mask="0x1" edc:name="TU16BERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS1" edc:mask="0x1" edc:name="TU16BERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS2" edc:mask="0x1" edc:name="TU16BERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS3" edc:mask="0x1" edc:name="TU16BERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS4" edc:mask="0x1" edc:name="TU16BERS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS5" edc:mask="0x1" edc:name="TU16BERS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
