garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q20.PIC
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="U2CON2" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="U2CON2" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1CF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLO" edc:desc="" edc:mask="0x3" edc:name="FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TXPOL" edc:desc="" edc:mask="0x1" edc:name="TXPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="STP" edc:desc="" edc:mask="0x3" edc:name="STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RXPOL" edc:desc="" edc:mask="0x1" edc:name="RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RUNOVF" edc:desc="" edc:mask="0x1" edc:name="RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLO0" edc:desc="" edc:mask="0x1" edc:name="FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLO1" edc:desc="" edc:mask="0x1" edc:name="FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="STP0" edc:desc="" edc:mask="0x1" edc:name="STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STP1" edc:desc="" edc:mask="0x1" edc:name="STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2FLO" edc:desc="" edc:mask="0x3" edc:name="U2FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U2TXPOL" edc:desc="" edc:mask="0x1" edc:name="U2TXPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U2STP" edc:desc="" edc:mask="0x3" edc:name="U2STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U2RXPOL" edc:desc="" edc:mask="0x1" edc:name="U2RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RUNOVF" edc:desc="" edc:mask="0x1" edc:name="U2RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U2FLO0" edc:desc="" edc:mask="0x1" edc:name="U2FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2FLO1" edc:desc="" edc:mask="0x1" edc:name="U2FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U2STP0" edc:desc="" edc:mask="0x1" edc:name="U2STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2STP1" edc:desc="" edc:mask="0x1" edc:name="U2STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="U2BRG" edc:desc="" edc:name="U2BRG" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1D0">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U2BRGL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U2BRGL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1D0">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGL" edc:desc="" edc:mask="0xff" edc:name="BRGL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U2BRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U2BRGH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1D1">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0xff" edc:name="BRGH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnrrrrr" edc:cname="U2FIFO" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00101110" edc:name="U2FIFO" edc:nzwidth="8" edc:por="00101110" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1D2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:desc="" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBE" edc:desc="" edc:mask="0x1" edc:name="RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XON" edc:desc="" edc:mask="0x1" edc:name="XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXIDL" edc:desc="" edc:mask="0x1" edc:name="RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBF" edc:desc="" edc:mask="0x1" edc:name="TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:desc="" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STPMD" edc:desc="" edc:mask="0x1" edc:name="STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXWRE" edc:desc="" edc:mask="0x1" edc:name="TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2RXBF" edc:desc="" edc:mask="0x1" edc:name="U2RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXBE" edc:desc="" edc:mask="0x1" edc:name="U2RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2XON" edc:desc="" edc:mask="0x1" edc:name="U2XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXIDL" edc:desc="" edc:mask="0x1" edc:name="U2RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXBF" edc:desc="" edc:mask="0x1" edc:name="U2TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXBE" edc:desc="" edc:mask="0x1" edc:name="U2TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2STPMD" edc:desc="" edc:mask="0x1" edc:name="U2STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXWRE" edc:desc="" edc:mask="0x1" edc:name="U2TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="U2RCIDL" edc:mask="0x1" edc:name="U2RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x1D3"/>
        <edc:SFRDef edc:access="nn---n--" edc:cname="U2UIR" edc:desc="" edc:impl="0xc4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---0--" edc:name="U2UIR" edc:nzwidth="8" edc:por="00---0--" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x10" edc:_end="0x13" edc:_addr="0x1D4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ABDIE" edc:desc="" edc:mask="0x1" edc:name="ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ABDIF" edc:desc="" edc:mask="0x1" edc:name="ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUIF" edc:desc="" edc:mask="0x1" edc:name="WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U2ABDIE" edc:desc="" edc:mask="0x1" edc:name="U2ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U2ABDIF" edc:desc="" edc:mask="0x1" edc:name="U2ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2WUIF" edc:desc="" edc:mask="0x1" edc:name="U2WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
