garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q20.PIC
        <edc:SFRDef edc:access="nnn-nnn-" edc:cname="U2ERRIR" edc:desc="" edc:impl="0xee" edc:isindirect="false" edc:isvolatile="true" edc:mclr="100-000-" edc:name="U2ERRIR" edc:nzwidth="8" edc:por="100-000-" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x10" edc:_end="0x13" edc:_addr="0x1D5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIF" edc:desc="" edc:mask="0x1" edc:name="RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIF" edc:desc="" edc:mask="0x1" edc:name="RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIF" edc:desc="" edc:mask="0x1" edc:name="FERIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIF" edc:desc="" edc:mask="0x1" edc:name="PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIF" edc:desc="" edc:mask="0x1" edc:name="TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U2RXFOIF" edc:desc="" edc:mask="0x1" edc:name="U2RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXBKIF" edc:desc="" edc:mask="0x1" edc:name="U2RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2FERIF" edc:desc="" edc:mask="0x1" edc:name="U2FERIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U2ABDOVF" edc:desc="" edc:mask="0x1" edc:name="U2ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2PERIF" edc:desc="" edc:mask="0x1" edc:name="U2PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXMTIF" edc:desc="" edc:mask="0x1" edc:name="U2TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnn-" edc:cname="U2ERRIE" edc:desc="" edc:impl="0xee" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-000-" edc:name="U2ERRIE" edc:nzwidth="8" edc:por="000-000-" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="4" edc:_begin="0x10" edc:_end="0x13" edc:_addr="0x1D6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIE" edc:desc="" edc:mask="0x1" edc:name="RXFOIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIE" edc:desc="" edc:mask="0x1" edc:name="RXBKIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIE" edc:desc="" edc:mask="0x1" edc:name="FERIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVE" edc:desc="" edc:mask="0x1" edc:name="ABDOVE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIE" edc:desc="" edc:mask="0x1" edc:name="PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIE" edc:desc="" edc:mask="0x1" edc:name="TXMTIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U2RXFOIE" edc:desc="" edc:mask="0x1" edc:name="U2RXFOIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXBKIE" edc:desc="" edc:mask="0x1" edc:name="U2RXBKIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2FERIE" edc:desc="" edc:mask="0x1" edc:name="U2FERIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U2ABDOVE" edc:desc="" edc:mask="0x1" edc:name="U2ABDOVE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2PERIE" edc:desc="" edc:mask="0x1" edc:name="U2PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXMTIE" edc:desc="" edc:mask="0x1" edc:name="U2TXMTIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SPI1RXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SPI1RXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x1D7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:mask="0xff" edc:name="RXB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB0" edc:mask="0x1" edc:name="RXB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1" edc:mask="0x1" edc:name="RXB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB2" edc:mask="0x1" edc:name="RXB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB3" edc:mask="0x1" edc:name="RXB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB4" edc:mask="0x1" edc:name="RXB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB5" edc:mask="0x1" edc:name="RXB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB6" edc:mask="0x1" edc:name="RXB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB7" edc:mask="0x1" edc:name="RXB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="SPI1TXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SPI1TXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x1D8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:mask="0xff" edc:name="TXB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0" edc:mask="0x1" edc:name="TXB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1" edc:mask="0x1" edc:name="TXB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2" edc:mask="0x1" edc:name="TXB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB3" edc:mask="0x1" edc:name="TXB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB4" edc:mask="0x1" edc:name="TXB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB5" edc:mask="0x1" edc:name="TXB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB6" edc:mask="0x1" edc:name="TXB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB7" edc:mask="0x1" edc:name="TXB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="SPI1TCNT" edc:desc="" edc:name="SPI1TCNT" edc:nzwidth="0x10" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x1D9">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPI1TCNTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPI1TCNTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x1D9">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TCNTL" edc:mask="0xff" edc:name="TCNTL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-----nnn" edc:cname="SPI1TCNTH" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SPI1TCNTH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x1DA">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TCNTH" edc:mask="0x7" edc:name="TCNTH" edc:nzwidth="0x3"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="SPI1CON0" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----000" edc:name="SPI1CON0" edc:nzwidth="8" edc:por="0----000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x1DB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BMODE" edc:mask="0x1" edc:name="BMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MST" edc:mask="0x1" edc:name="MST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSBF" edc:mask="0x1" edc:name="LSBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI1BMODE" edc:mask="0x1" edc:name="SPI1BMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1MST" edc:mask="0x1" edc:name="SPI1MST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1LSBF" edc:mask="0x1" edc:name="SPI1LSBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="SPI1SPIEN" edc:mask="0x1" edc:name="SPI1SPIEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
