garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q20.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="I2C1SDAPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="I2C1SDAPPS" edc:nzwidth="8" edc:por="---01101" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3AE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS" edc:mask="0x1f" edc:name="I2C1SDAPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS0" edc:mask="0x1" edc:name="I2C1SDAPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS1" edc:mask="0x1" edc:name="I2C1SDAPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS2" edc:mask="0x1" edc:name="I2C1SDAPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS3" edc:mask="0x1" edc:name="I2C1SDAPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS4" edc:mask="0x1" edc:name="I2C1SDAPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3AF"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ADACTPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ADACTPPS" edc:nzwidth="8" edc:por="---10011" edc:_modsrc="DOS-05242_pps_mid_v4_input_Q20_20p_8bit.Module" edc:_refcount="2" edc:_begin="0x21" edc:_end="0x4f" edc:_addr="0x3B1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADACTPPS" edc:mask="0x1f" edc:name="ADACTPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADACTPPS0" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS1" edc:mask="0x1" edc:name="ADACTPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS2" edc:mask="0x1" edc:name="ADACTPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS3" edc:mask="0x1" edc:name="ADACTPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS4" edc:mask="0x1" edc:name="ADACTPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x3B2"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x4" edc:beginaddr="0x0400" edc:endaddr="0x0460" edc:regionid="sfr4">
        <edc:AdjustPoint edc:offset="0x16" edc:_addr="0x400"/>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="ANSELA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--11-111" edc:name="ANSELA" edc:nzwidth="8" edc:por="--11-111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x416">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELA0" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA1" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA2" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSELA4" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA5" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="WPUA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="WPUA" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x417">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUA0" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA1" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA2" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA3" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA4" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUA5" edc:mask="0x1" edc:name="WPUA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="ODCONA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00-000" edc:name="ODCONA" edc:nzwidth="8" edc:por="--00-000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x418">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCA0" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA1" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA2" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODCA4" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCA5" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="SLRCONA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--11-111" edc:name="SLRCONA" edc:nzwidth="8" edc:por="--11-111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x419">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRA0" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA1" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA2" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SLRA4" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRA5" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INLVLA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="INLVLA" edc:nzwidth="8" edc:por="--111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLA0" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA1" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA2" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA3" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA4" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLA5" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAP" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAP" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAP0" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP1" edc:mask="0x1" edc:name="IOCAP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP2" edc:mask="0x1" edc:name="IOCAP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP3" edc:mask="0x1" edc:name="IOCAP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP4" edc:mask="0x1" edc:name="IOCAP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP5" edc:mask="0x1" edc:name="IOCAP5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAN" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAN0" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN1" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN2" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN3" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN4" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN5" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x41E"/>
        <edc:SFRDef edc:access="n-------" edc:cname="ANSELB" edc:desc="" edc:impl="0x80" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------" edc:name="ANSELB" edc:nzwidth="8" edc:por="1-------" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x420">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSELB7" edc:mask="0x1" edc:name="ANSELB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="WPUB" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="WPUB" edc:nzwidth="8" edc:por="000-----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x421">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WPUB5" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB6" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB7" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="ODCONB" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="ODCONB" edc:nzwidth="8" edc:por="000-----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x422">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODCB5" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB6" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB7" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="SLRCONB" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="111-----" edc:name="SLRCONB" edc:nzwidth="8" edc:por="111-----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x423">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SLRB5" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB6" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB7" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
