garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q20.PIC
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="IOCCF" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="IOCCF" edc:nzwidth="8" edc:por="00000-00" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x431">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCF0" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF1" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF3" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF4" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF5" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF6" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF7" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x25" edc:_addr="0x432"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCWP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCWP" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x5" edc:_end="0x8" edc:_addr="0x457">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCWP0" edc:mask="0x1" edc:name="IOCWP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP1" edc:mask="0x1" edc:name="IOCWP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP2" edc:mask="0x1" edc:name="IOCWP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP3" edc:mask="0x1" edc:name="IOCWP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP4" edc:mask="0x1" edc:name="IOCWP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP5" edc:mask="0x1" edc:name="IOCWP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP6" edc:mask="0x1" edc:name="IOCWP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP7" edc:mask="0x1" edc:name="IOCWP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCWN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCWN" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x5" edc:_end="0x8" edc:_addr="0x458">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCWN0" edc:mask="0x1" edc:name="IOCWN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN1" edc:mask="0x1" edc:name="IOCWN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN2" edc:mask="0x1" edc:name="IOCWN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN3" edc:mask="0x1" edc:name="IOCWN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN4" edc:mask="0x1" edc:name="IOCWN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN5" edc:mask="0x1" edc:name="IOCWN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN6" edc:mask="0x1" edc:name="IOCWN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN7" edc:mask="0x1" edc:name="IOCWN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCWF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCWF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x5" edc:_end="0x8" edc:_addr="0x459">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCWF0" edc:mask="0x1" edc:name="IOCWF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF1" edc:mask="0x1" edc:name="IOCWF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF2" edc:mask="0x1" edc:name="IOCWF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF3" edc:mask="0x1" edc:name="IOCWF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF4" edc:mask="0x1" edc:name="IOCWF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF5" edc:mask="0x1" edc:name="IOCWF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF6" edc:mask="0x1" edc:name="IOCWF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF7" edc:mask="0x1" edc:name="IOCWF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x4" edc:beginaddr="0x0460" edc:endaddr="0x0500" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="-------n" edc:cname="IVTLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="IVTLOCK" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x460">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IVTLOCKED" edc:desc="" edc:mask="0x1" edc:name="IVTLOCKED" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn--nnn" edc:cname="INTCON0" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--111" edc:name="INTCON0" edc:nzwidth="8" edc:por="000--111" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x461">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0EDG" edc:desc="" edc:mask="0x1" edc:name="INT0EDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1EDG" edc:desc="" edc:mask="0x1" edc:name="INT1EDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2EDG" edc:desc="" edc:mask="0x1" edc:name="INT2EDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="IPEN" edc:desc="" edc:mask="0x1" edc:name="IPEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GIEL" edc:desc="" edc:mask="0x1" edc:name="GIEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GIE" edc:desc="" edc:mask="0x1" edc:name="GIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="GIEH" edc:mask="0x1" edc:name="GIEH" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rr------" edc:cname="INTCON1" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00------" edc:name="INTCON1" edc:nzwidth="8" edc:por="00------" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x462">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="STAT" edc:mask="0x3" edc:name="STAT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="STAT0" edc:mask="0x1" edc:name="STAT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STAT1" edc:mask="0x1" edc:name="STAT1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="IVTAD" edc:desc="" edc:name="IVTAD" edc:nzwidth="0x18" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x463">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IVTAD" edc:desc="" edc:islanghidden="true" edc:mask="0x1fffff" edc:name="IVTAD" edc:nzwidth="21"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IVTADL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IVTADL" edc:nzwidth="0x8" edc:por="00000000" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x463">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="IVTADL" edc:desc="" edc:mask="0xff" edc:name="IVTADL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IVTADH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IVTADH" edc:nzwidth="0x8" edc:por="00000000" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x464">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="IVTADH" edc:desc="" edc:mask="0xff" edc:name="IVTADH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="IVTADU" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="IVTADU" edc:nzwidth="0x8" edc:por="---00000" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x465">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="IVTADU" edc:desc="" edc:mask="0x1f" edc:name="IVTADU" edc:nzwidth="5"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
