garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q20.PIC
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="PIR7" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="PIR7" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x470">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IF" edc:mask="0x1" edc:name="SPI1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1RXIF" edc:mask="0x1" edc:name="I2C1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIF" edc:mask="0x1" edc:name="I2C1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IF" edc:mask="0x1" edc:name="I2C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIF" edc:mask="0x1" edc:name="I2C1EIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---rrrrr" edc:cname="PIR8" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PIR8" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x471">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I3C1RXIF" edc:mask="0x1" edc:name="I3C1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C1TXIF" edc:mask="0x1" edc:name="I3C1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C1IF" edc:mask="0x1" edc:name="I3C1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C1EIF" edc:mask="0x1" edc:name="I3C1EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C1RIF" edc:mask="0x1" edc:name="I3C1RIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnrrrrr" edc:cname="PIR9" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR9" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x472">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I3C2RXIF" edc:mask="0x1" edc:name="I3C2RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C2TXIF" edc:mask="0x1" edc:name="I3C2TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C2IF" edc:mask="0x1" edc:name="I3C2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C2EIF" edc:mask="0x1" edc:name="I3C2EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C2RIF" edc:mask="0x1" edc:name="I3C2RIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIF" edc:mask="0x1" edc:name="HLVDIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIF" edc:mask="0x1" edc:name="ADIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADTIF" edc:mask="0x1" edc:name="ADTIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrnn" edc:cname="PIE0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x473">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWIE" edc:mask="0x1" edc:name="SWIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0IE" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IE" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2IE" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1SCNTIE" edc:mask="0x1" edc:name="DMA1SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1DCNTIE" edc:mask="0x1" edc:name="DMA1DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1ORIE" edc:mask="0x1" edc:name="DMA1ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1AIE" edc:mask="0x1" edc:name="DMA1AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x474">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DMA2SCNTIE" edc:mask="0x1" edc:name="DMA2SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIE" edc:mask="0x1" edc:name="DMA2DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIE" edc:mask="0x1" edc:name="DMA2ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIE" edc:mask="0x1" edc:name="DMA2AIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3SCNTIE" edc:mask="0x1" edc:name="DMA3SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3DCNTIE" edc:mask="0x1" edc:name="DMA3DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3ORIE" edc:mask="0x1" edc:name="DMA3ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3AIE" edc:mask="0x1" edc:name="DMA3AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE2" edc:desc="" edc:impl="0xe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x475">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DMA4SCNTIE" edc:mask="0x1" edc:name="DMA4SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIE" edc:mask="0x1" edc:name="DMA4DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIE" edc:mask="0x1" edc:name="DMA4ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIE" edc:mask="0x1" edc:name="DMA4AIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMIE" edc:mask="0x1" edc:name="NVMIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIE" edc:mask="0x1" edc:name="CRCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIE" edc:mask="0x1" edc:name="SCANIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTIE" edc:mask="0x1" edc:name="ACTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
