garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q20.PIC
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="LATC" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="LATC" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_modsrc="DOS-PORTx_8bit_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x495">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC4" edc:desc="" edc:mask="0x1" edc:name="LATC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC5" edc:desc="" edc:mask="0x1" edc:name="LATC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC7" edc:desc="" edc:mask="0x1" edc:name="LATC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x496"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x497"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x498"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTW" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PORTW" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x499">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="RW0" edc:mask="0x1" edc:name="RW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW1" edc:mask="0x1" edc:name="RW1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW2" edc:mask="0x1" edc:name="RW2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW3" edc:mask="0x1" edc:name="RW3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW4" edc:mask="0x1" edc:name="RW4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW5" edc:mask="0x1" edc:name="RW5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW6" edc:mask="0x1" edc:name="RW6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW7" edc:mask="0x1" edc:name="RW7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATW" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LATW" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x49A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATW0" edc:mask="0x1" edc:name="LATW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW1" edc:mask="0x1" edc:name="LATW1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW2" edc:mask="0x1" edc:name="LATW2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW3" edc:mask="0x1" edc:name="LATW3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW4" edc:mask="0x1" edc:name="LATW4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW5" edc:mask="0x1" edc:name="LATW5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW6" edc:mask="0x1" edc:name="LATW6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW7" edc:mask="0x1" edc:name="LATW7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PORTWIN0" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PORTWIN0" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x49B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0x7" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PORTWIN1" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PORTWIN1" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x49C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0x7" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PORTWIN2" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PORTWIN2" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x49D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0x7" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
